<?php
    $x = 10;
    $y = 20;

    echo $x + $y . "<br>"; // сложение
    echo $x - $y . "<br>"; // вычитание
    echo $x * $y . "<br>"; // умножение
    echo $x / $y . "<br>"; // деление
    echo $x % $y . "<br>"; // вывод остатка при деление

    $x += 10; // $x = $x + 10;
    echo $x . "<br>";
    $y -= 10; // $x = $x - 10;
    echo $y . "<br>";
    $x++; echo $x.'<br>'; // $x = $x + 1; || $x += 1;
    $x--; echo $x.'<br>'; // $x = $x - 1; || $x -= 1;

    echo M_PI.'<br>'; // вывод числа пи
    echo M_E.'<br>'; // вывод числа е

    echo abs(-22).'<br>';
    // функция возвращает позитивное значение числа.
    echo ceil(3.1).'<br>'; // функция округляет всегда к большему
    echo floor(3.1).'<br>'; // функция всегда округляет к меньшему
    echo round(3.1).'<br>'; // функция просто округляет
    echo round(3.134535, 2).'<br>';
    // через запятую вводится до какого числа будет произведено округленние

    echo sin(3.2).'<br>'; // синусы
    echo cos(3.2).'<br>'; // косинусы
    echo tan(3.2).'<br>'; // тангенсы

    echo mt_rand(0, 20).'<br>'; // функция рандомного числа
    echo rand(0, 30).'<br>'; // тоже вроде

    echo min(2,4,56,8,4).'<br>';
    // функция находит минимальное число
    echo max(2,4,56,8,4).'<br>';
    // функция находит максимальное число

?>
